Revit 2020 API
RebarShape.HasEndTreatment Method
 returns true if the shape has end treatment for at least one end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2017
Syntax
C#
public bool HasEndTreatment()
Visual Basic
Public Function HasEndTreatment As Boolean
Visual C++
public:
bool HasEndTreatment()
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace